[
    {
        "number": 1,
        "title": "Software Team",
        "resources": "Equipment: \n \nZed camara 2i \nNvidia Jetson Tx2 \n\nTechnical Tools: \nGazebo\nRviz",
        "description": "\nRviz/Gazebo simulation robot: In order to use a reliable method of exploration and obstacle representation in a 3d environment we link both a gazebo world and rviz to analyze the data received by the submarine. Perception/Navigation feedback: YOLACT does instance segmentation in two steps: the first is to create image-sized semantic masks using the FCN method, and the second is to predict parameters to explicitly segment those semantic masks at the instance level. A backbone network, a detection branch, and an instance segmentation branch make up the YOLACT network. Obstacle detection and instance segmentation are based on YOLACT's work, which integrates these two tasks into a single phase. The following image depicts the tests made with a previously pretrained model running in a Zed 2i camera and RVIZ. Underwater exploration: Exploration is essential for enhancing our understanding of our surroundings so that we can navigate it more efficiently and improve our robot's performance. We're using a new method of exploration with weights based on previous results obtained by vision systems, which in this case will be a stereo camera with Yolact running through it, which will give us the possible location of obstacles and then we'll be able to explore zones with a high chance of finding an object as if it were a heatmap graph. Multiple world environments: To test our exploration algorithm, we needed a variety of scenarios in which the submarine had to perceive potential obstacles and act in accordance with our state machine's architecture. We improved the code that has to be done prevously to change a pose of each obstacle into one that is easier to use and create multiple worlds. The following image is the representation of one of the environments that were created to simulate our submarine.",
        "results": "Yolact implementation in a stereo camera. Gazebo and Rviz interaction to provide better control in our robot simulation. Multiple world environments to test our missions and underwater exploration. The algorithm of underwater exploration is still in progress, he hopes to have results at the end of this month.",
        "justification": "Underwater exploration is all about making new discoveries and looking for unusual and unexpected things. We acquire data and information needed to make robusts algorithms. That is why, we have increased part of our research in knowing our environment better than ever before.",
        "difficulties": "The progress we have made is still in progress to be implemented in a physical submarine but we are sure it is going to have a good performance.",
        "author": "Team Leader: Edison Ricardo Altamirano Avila",
        "images": ["https://i.ibb.co/ZzZHkbN/Screen-Shot-2022-06-22-at-17-22-11.png",
        "https://i.ibb.co/2chk9xy/Screen-Shot-2022-06-22-at-17-22-19.png",
        "https://i.ibb.co/qWM53nx/Screen-Shot-2022-06-22-at-17-22-32.png",
        "https://i.ibb.co/7y27x2F/Screen-Shot-2022-06-22-at-17-22-38.png",
        "https://i.ibb.co/G9x5LQY/Screen-Shot-2022-06-22-at-17-22-54.png"]
    },
    {
        "number": 2,
        "title": "Rack Team",
        "resources": "Equipment: Submarine’s enclosure 3D Printer Technical Tools: Solidworks",
        "description": "We worked with the Solidworks software to develop a new design of a cylindrical rack that carries the electronic system of our submarine, that goes inside an enclosure. Last semester, we had an already finished design of this component, but it went according to the measurements of our old enclosure, which is smaller, and we also found out the vertical floors distribution where the electrical components where mounted was not the most optimal, so we decided to start over and create a new design, which focused on distributing the components horizontally, so mainly the cable distribution would come easier. For this activity, we started by measuring the size of each of the electrical components that we were going to store in our rack design, then we talked with the electrical team about the placement of this components that will result the most optimal and practical according to our priorities, which between both teams we decided that would be having a design that is easily demountable, simple, and allows the cables of the electrical components to be placed the best way possible. According to the measurements and placing of the components, we landed on creating three thin horizontal floors held by long screws and 3D printed supports that connected these long screws with the floors. Additionally, at each end of this design we created lids which held up the design and also, the frontal lid, was specifically designed to hold our vision camera facing the transparent lid of our enclosure. These rack lids were 3D printed. Our next step is manufacturing our last component, the floors, which are planned to be made out of acetal material. ",
        "results": "We managed to create a functional design for the electronic system, it is a very functional system, which took many hours of work, so far we have printed 2 pieces which are the blue supports that can be seen in the images, one for the camera and one for the back, and in the future we will print the missing pieces that will be made of resin.",
        "justification": "We got this design after a great discussion between the different teams, as already mentioned, and it is as functional as possible, it was already approved by several people, this design is the result of many other discarded designs, we wanted to have an easy access to all of the electronic parts and the camera has an excellent support.",
        "difficulties": "Some of the difficulties that we had was that the electronic team had to approve every change to the rack and sometimes it was difficult to achieve good communication. We’ve also struggled with acquiring some materials for our design, specifically acetal for our rack’s floors, because the buying process we have allowed takes a long time to process, which makes our team work slower. Lastly, we lightly struggled as with every digital design, with some measurements and, for example, assuring that when the 3D printing came around, the designs would work perfectly.",
        "author": "Team Leader: Diego Martinez",
        "images": ["https://i.ibb.co/ChS3xM7/Screen-Shot-2022-06-22-at-21-17-55.png", "https://i.ibb.co/YPSCbc5/Screen-Shot-2022-06-22-at-21-15-46.png"]
    },
    {
        "number": 3,
        "title": "Perception Team",
        "resources": "Equipment: Zed camara 2i Nvidia Jetson Tx2 Technical Tools: Pytorch framework",
        "description": "Training a YOLACT technique for instance segmentation. To train the model we gathered 3000 photos and labeled them and augmented them. After training, it was worked on implementing them in ROS afterwards.",
        "results": "The neural network was trained for a period of 5 hours, this time was enough to perform 54 epochs. The results obtained are shown In the last iteration, a mean average precision of 10.17 was calculated for the frames and 10.17 for the masks. In addition, the network was tested with 30% of the dataset destined for validation. In the table, some of the tested images are shown, with their classification vs the environment they were in.",
        "justification": "Underwater exploration is all about making new discoveries and looking for unusual and unexpected things. We acquire data and information needed to make robusts algorithms. That is why, we have increased part of our research in knowing our environment better than ever before.",
        "difficulties": "The progress we have made is still in progress to be implemented in a physical submarine but we are sure it is going to have a good performance.",
        "author": "Team Leader: Saúl Bermea González",
        "images": ["https://i.ibb.co/BKCWHt1/Screen-Shot-2022-06-22-at-21-22-02.png"]
    },
    {
        "number": 4,
        "title": "Localization Team",
        "resources": "Matlab software in order to compare values and understand the process. Python in order to create an extended version of the algorithm and to integrate it with the software ROS. With the software ROS, we included a simulation of the response and values of an IMU as well as with the simulated environment, we got to see how it does work in real-time as well as to compare the values of the algorithm with the real values given by the software.",
        "description": "On the localization team, we worked on the design and implementation of a Kalman filter that allows the user to obtain a better approximation of the vehicle’s state (position, orientation, and velocity). To provide precise and accurate information about the vehicle, we made use of an IMU sensor, which even though it is a high precision tool, can fail to provide proper results when being used in a non-usual environment, like water, reason why we must work with both elements: measurements and estimations (predictions). ",
        "results": "After running the algorithm in the software ROS we obtained the level of exactitude we were looking for, exact values for the first eight decimal digits for both the X and Y axis values, however for the depth or Z axis we obtained a level of uncertainty of ± 0.75 as well as random errors, therefore adjustments must be made before using this Kalman Filter to estimate also the depth of the submarine.",
        "justification": "To achieve the proper vehicle functionality, it is necessary that the vehicle’s control system works adequately so that the user can monitor and study the vehicle’s state at all times. Because it is not possible to work with a traditional GPS in a subaquatic environment, we must work on finding proper estimation methods that can provide the most accurate information for the vehicle’s position and velocity, in this case a Kalman Filter, using the position and velocity definitions provided by the “HANDBOOK OF MARINE CRAFT HYDRODYNAMICS AND MOTION CONTROL” by Thor I. Fossen.",
        "difficulties": "We are still in the testing phase, which is why we are only working on simulations for now. The next step would be to actually implement and blend in the sensor on our actual codes so that the measurements being read are from a physical sensor and not values that we included in our code. The estimation of the values of the Z axis have also represented a challenge itself, therefore we decided to implement a barometer to provide more precise and exact values from the algorithm. And when this step is covered, the next thing to do would be to actually test it in water!",
        "author": "Andrés Emilio Sánchez Calvo, Sicilia Pompa Lozano and Emiliano Prado Wabe",
        "images" : ["https://i.ibb.co/cDcFf9w/Screen-Shot-2022-06-22-at-21-26-18.png","https://i.ibb.co/YNf7wnd/Screen-Shot-2022-06-22-at-21-26-49.png"]
    }
]