[
    {
        "number": 1,
        "title": "Software",
        "resources": "New scripts in python were implemented using rospy functionality in the ROS Melodic distro.",
        "description": "Four new implementations were carried out: \nThe first and most basic one is that a new script that publishes markers in RVIZ in the same frame as velodyne pointclouds. These markers share the coordinates of objects detected by the LiDAR-based detector. \n The second implementation is a script that registers each detection by the LiDAR-based detector in a global frame. These registers have a status that changes during its execution. The first and default status is ‘registered’ when an object is first added to the registry list. The second status is ‘persistent’, when the script detects an object several times in the same range of XY coordinates of an already registered object. The third status is ‘verified’ that is applied when an object detected using the YOLOv3-ZED based detector shares the same coordinates as an already registered object. \n These status have the functionality of being able to filter out noise-generated detections and to further augment the overall system’s perception capabilities. \n The third implementation is a pool filtering script. Due to our main testing environment being an outdoor pool, objects with the same dimensions as buoys, markers or docks were incorrectly detected and registered. To fix this, a filter was made that takes as input the 4 gps coordinates of the pool and with the initial reference point of the boat, calculates distances to the limits of the pool. Objects that are outside the desired range are filtered out. \n The fourth implementation was the conversion of SBG_Ros topics to publish directly to /vectornav/ins2d topics, which our software architecture mainly uses. This change is temporal as ideally, all scripts should read data directly from the SBG Node.",
        "results": "All scripts show promising results but can be further refined. The pool filtering script works as it relies on the fact the sides of the pool are parallel to compass directions (North, South, etc), but can be further improved by also being able to manage areas with different orientations.",
        "justification": "Results were good and promising, being already published in new branches or implemented.",
        "difficulties": "Lack of actual testing on the USV platform.\n Implementations were tested using logged LiDAR, ZED and Vectornav sensor data. \nDetection systems running at low frequencies affect the outputs of the system.",
        "author": "Rogelio Saláis",
        "images": []
    },
    {
        "number": 2,
        "title": "Skeeball - Mechanics Team",
        "resources": "Materials and equipment:\n-Screw -Paint -Tape measure -Saw\n-Dremel -Bucket",
        "description": "Create a prop with the proposed dimensions, including the visual aids. \nThe project started by modeling the proposed design on SolidWorks, to then go to buy and prepare the materials to be able to assemble the prototype. \nThe 4 holes were cut in an mdf board and then it was joined to 4 thicker wooden boards to give the piece firmness, they were joined by means of screws. Then the outline of the circles was painted.",
        "results": "We obtained a good prototype to carry out the corresponding tests of the challenge.",
        "justification": "This prototype had not been used before by the team, so it is a new experience and the results will be observed with this new prototype to visualize possible improvements for the following ones.",
        "difficulties": "The only difficulty was being able to cut the circles very straight, since we did not have special tools for that and we had to adapt the dremel to cut them.",
        "author": "Mechanics Team:\nTeam leader: Mauricio Sánchez López\nTeam partner: Rodrigo Alejandro Garza Reyes",
        "images": ["https://i.ibb.co/4RL9bxr/skeeball.png"]
    },
    {
        "number": 3,
        "title": "Challenge detection",
        "resources": "",
        "description": "The software team developed a script that could detect the starting point of relevant challenges so that ROS nodes could set up waypoints to those starting points.",
        "results": "The script detected the start of the channel successfully.",
        "justification": "Using linear algebra, an algorithm was developed to find the starting point of the channel challenge by finding the gate that does not have gates on both sides at the same time. This algorithm would work as long as the gate for the snack run was filtered out of the detected objects in the challenge area.",
        "difficulties": "The main difficulty behind designing this algorithm was finding out unique features for the 2 edge gates.",
        "author": "Software team:\n-Ian De la Garza\n-David Rogelio Saláis\n-Javier Prieto\n",
        "images": ["https://i.ibb.co/yykYRQy/challengedetection.png"]
    },
    {
        "number": 4,
        "title": "Designing and prototyping the mechanism for the new challenges",
        "resources": "Technical tools: \n-SOLIDWORKS \n-Rapid Prototyping",
        "description": "In this year's competition some new challenges were added, both of them involved shooting at targets, which meant work for the mechanics team. We had to make our boat shoot water and balls, this came with a lot of factors to consider, such as using the water below the boat instead of having the boat carry a limited supply of water. While on the ball shooter we did have to carry the balls and make a reliable system that could aim without having issues carrying the balls. \nWe didn't get all of the dimensions for the tasks at hand, so we worked without knowing how long the ball had to shoot, what size ball was going to be used, etc. This was very important when thinking of what approach to have while fabricating the prototypes. We wanted to design a mechanism that could be adjustable to different size balls, so that even if we didn't have the objects that would be used in the competition, we could still test the mechanism.",
        "results": "We were able to design a couple of prototypes for the mechanisms and fabricate a functional one for each. Before getting to the functional prototype we considered advantages and disadvantages for each design and two of the most important factors we considered were ease of build and being adjustable.",
        "justification": "The approach we took helped us work without having all of the objects necessary to test it, while this made the process of prototyping cheaper, it did come with some issues, as we used different materials that were not final we would have to fabricate another product in order to make ir rugged enough, but this is what prototyping is all about, getting to know the issues that could happen later by attempting to create something in less time and with less resources.",
        "difficulties": "As mentioned before, the little amount of information given to us made it so that even if we fabricated the best mechanism posible, it would most likely have to change when the actual dimensions and specification were given. We also had a big issue to test it on the actual boat, because it being a prototype it was frail, and mounting it to the boat wasn't safe, asi it could fall in the water. ",
        "author": "Mechanics team: \nTeam Leader: Mauricio Sánchez López \nTeam partners: Rodrigo Alejandro Garza Reyes\n Fernando Arizpe ",
        "images" : ["https://i.ibb.co/Htvpm9r/prototype-2.png","https://i.ibb.co/y8dbN9v/prototype-3.png","https://i.ibb.co/hgCbLzN/prototype.png"]
    }, 
    {
        "number": 5,
        "title": "Prototyping our new electronics system",
        "resources": "Technical tools: \nKiCad \nSOLIDWORKS",
        "description": "For this year, we decided to work on our old PCBs that we had created for the previous online competition. With this, we decided to iterate on our old design, which last year had gotten to the prototype stage, in order to create a more reliable, reproducible and robust system. For this, we decided to work on two new and improved designs, based on our past work. \nWe designed a new circuit board for the power distribution inside the boat, in order to have a better management of the wires. This also implements a remote controlled killswitch, to disable the motors through relays when needed, besides the physical emergency killswitch button. Compared to the past iteration, we believe that this is a more reliable and safer way to provide power to the motor thanks to the fact that each motor channel has its own fuse. By creating a new power distribution board, we were able to reduce the amount of manual labor and wiring that is needed, which in turn reduces the amount of time required to give maintenance or to perform repairs, as the wiring is much less complex and error-prone.\nAs an iteration to our previous main motor controller PCB, we modified our design in order to make it compact and more compatible with our design for RoboSub. Furthermore, we fixed any errors that we had found in our previous prototypes, making this PCB almost “production-ready” (for competition). Its capabilities were also improved, with support for more PWM channels, an improved debug breakout functionality and support for more sensors.\nIn order to complement our electronic system redesign, we created a new layout using CAD design. This allows us to be able to place our components precisely. We were also able to share the CAD design of the boat with the rest of the team through GrabCAD. This facilitated collaboration and organization with our CAD files.",
        "results": "The new designs were sent off to our PCB manufacturer in China. These were assembled in our lab. Currently, we have been testing and implementing bug fixes on a test-rig outside the boat, and we plan on installing them inside our USV as soon as possible.",
        "justification": "We believe that this electronics upgrade is extremely beneficial for our vehicle’s functionality, especially when it comes to the power distribution. This year, we faced constant issues with the original wiring and electrical design. Furthermore, we faced difficulties with our previous arduino based motor control system. Based on these factors, we believe that an improvement was needed if we wanted to be able keep the boat’s basic functionality afloat. We believe that after this iteration is complete, we will see a decrease in downtime for maintenance and repairs which in turn means more time for testing and experimentation for our control systems.",
        "difficulties": "Throughout this year, we have been affected by chip shortages during the development of our boards. Thanks to this shortage, we’ve had to modify past designs, cut back on some features as we weren’t able to buy the chips that we planned on using. Furthermore, the chip shortage has increased costs considerably, which means that we were not able to create as many prototypes as we would have liked to create. With these factors, our development timeline had to be extended, as extra considerations had to be made at every step of the design process. ",
        "author": "Electronics and Embedded Development Team\nTeam Leader: Abiel Fernández",
        "images": ["https://i.ibb.co/MDzTQRc/unnamed-5.png","https://i.ibb.co/Y7Wyv5q/unnamed-4.png","https://i.ibb.co/MZKHC2F/unnamed-3.png","https://i.ibb.co/WB5MpnW/unnamed-2.png","https://i.ibb.co/sPznRq0/unnamed-2.jpg","https://i.ibb.co/h1ss4K2/unnamed.jpg"]
    }
]